fmuni_cases/STR_for_space/constant/physicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/globalVars"

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species
(
    H2O
    O2
);

defaultSpecie H2O;

"mixture|H2O"
{
    specie
    {
        molWeight   18.02;
    }
    equationOfState
    {
        C (0.001278 -2.1055e-06 3.9689e-09 4.3772e-13 -2.0225e-16);
        rho         997;
    }
    thermodynamics
    {
        Cp          4180;
        Cv          4135;
        hf          0;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrMixLiq;
    }
}

O2
{
    specie
    {
        molWeight   31.9988;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf          -365639;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrO2;
    }
}

// ************************************************************************* //
