fmuni_cases/STR_for_space/constant/rotatingZoneProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      rotatingZoneProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

origin  (0 0 0);
axis    (0 0 -1);

    omega
    {
        type        table;
        units       ([s] [rpm]);
        values
        (
            (0     0)
            (1  500)
        );
    }
// ************************************************************************* //
