fmuni_cases/STR_for_space/system/createPatchDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
{
    stirrer
    {
        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches ("impeller_impeller.*");
    }
    
    shaft
    {
        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches ("impeller_shaft");
    }

    #include "spargerPatch"

    inlet
    {
        patchInfo
        {
            type patch;
        }

        constructFrom patches;

        patches ("sparger_.*");
    }       
 
}
