fmuni_cases/STR_for_space/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc fieldAverage
(
    alpha.gas,
    U.gas,
    U.liquid
)

#includeFunc gasHoldup

#includeFunc patchFlowRate
(
    name=inletGasFlow,
    field=alphaPhi.gas,
    patch=inlet,
    writeControl=timeStep,
    writeInterval=10
)

#includeFunc patchFlowRate
(
    name=outletGasFlow,
    field=alphaPhi.gas,
    patch=outlet,
    writeControl=timeStep,
    writeInterval=10
)

// ************************************************************************* //
