fmuni_cases/STR_for_space/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited<cubic> 1.5 leastSquares 1;

}

divSchemes
{
    default                     none;

    div(phi,alpha)              Gauss vanLeer;
    div(alphaRhoPhi,U)          Gauss limitedLinearV 1;
    div(phi,U)                  Gauss limitedLinearV 1;

    div(alphaRhoPhi,K)          Gauss limitedLinear 1;

    div(alphaRhoPhi,(p|rho))    Gauss limitedLinear 1;

    turbulence                  Gauss limitedLinear 1;
    div(alphaRhoPhi,k)          $turbulence;
    div(alphaRhoPhi,omega)      $turbulence;

    "div\(alphaRhoPhi,(h|e)\)"  Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,Yi\)"   Gauss limitedLinear 1;
    "div\(alphaPhi.*,f.*\)"     Gauss limitedLinear 1;

    div((((alpha*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
