fmuni_cases/STR_for_space/system/impeller
impeller_rotatingZone
{
   type cylinder;
   point1 ( 0 0 0.675 );
   point2 ( 0 0 1.425 );
   radius 1.3;
}
impeller_shaft
{
   type cylinder;
   point1 ( 0 0 1 );
   point2 ( 0 0 100 );
   radius 0.15;
}
impeller_disk
{
   type cylinder;
   point1 ( 0 0 1 );
   point2 ( 0 0 1.1 );
   radius 0.5;
}
impeller_blade
{
   type box;
   min ( 0.3 -0.025 0.8 );
   max ( 1.1 0.025 1.3 );
}
impeller
{
   type collection;
   mergeSubRegions true;
impeller_disk_0
{
    surface impeller_disk;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( 1 0 0 );
               e2 ( 0 1 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
impeller_blade_0
{
    surface impeller_blade;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( 1.0 0.0 0 );
               e2 ( -0.0 1.0 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
impeller_blade_1
{
    surface impeller_blade;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( 0.5000000000000001 0.8660254037844386 0 );
               e2 ( -0.8660254037844386 0.5000000000000001 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
impeller_blade_2
{
    surface impeller_blade;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( -0.4999999999999998 0.8660254037844387 0 );
               e2 ( -0.8660254037844387 -0.4999999999999998 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
impeller_blade_3
{
    surface impeller_blade;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( -1.0 1.2246467991473532e-16 0 );
               e2 ( -1.2246467991473532e-16 -1.0 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
impeller_blade_4
{
    surface impeller_blade;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( -0.5000000000000004 -0.8660254037844384 0 );
               e2 ( 0.8660254037844384 -0.5000000000000004 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
impeller_blade_5
{
    surface impeller_blade;
    scale (1.0 1.0 1.0);
    transform
    {
       coordinateSystem
       {
           type cartesian;
           origin ( 0 0 0 );
           coordinateRotation
           {
               type axesRotation;
               e1 ( 0.5000000000000001 -0.8660254037844386 0 );
               e2 ( 0.8660254037844386 0.5000000000000001 0 );
               e3 ( 0 0 1 );
           }
       }
    }
}
}
