fmuni_cases/STR_for_space/system/sparger

sparger_0
{
   type cylinder;
   point1 ( 0.75 0.0 -10 );
   point2 ( 0.75 0.0 0.1 );
   radius 0.1;
}
sparger_1
{
   type cylinder;
   point1 ( 0.3750000000000001 0.649519052838329 -10 );
   point2 ( 0.3750000000000001 0.649519052838329 0.1 );
   radius 0.1;
}
sparger_2
{
   type cylinder;
   point1 ( -0.37499999999999983 0.649519052838329 -10 );
   point2 ( -0.37499999999999983 0.649519052838329 0.1 );
   radius 0.1;
}
sparger_3
{
   type cylinder;
   point1 ( -0.75 9.184850993605148e-17 -10 );
   point2 ( -0.75 9.184850993605148e-17 0.1 );
   radius 0.1;
}
sparger_4
{
   type cylinder;
   point1 ( -0.37500000000000033 -0.6495190528383288 -10 );
   point2 ( -0.37500000000000033 -0.6495190528383288 0.1 );
   radius 0.1;
}
sparger_5
{
   type cylinder;
   point1 ( 0.3750000000000001 -0.649519052838329 -10 );
   point2 ( 0.3750000000000001 -0.649519052838329 0.1 );
   radius 0.1;
}
